# 자료(Data)
#   실질적인 값을 의미한다. (숫자, 문자, 등 실질적으로 표현되는 값을 Data라고 함)

# 자료형(Data type) 
#   실질적인 값의 형태를 의미한다.
#   대표적으로 숫자형, 문자형, 논리형(불린형/불리언형)

# ----------------------------------------------------------------------------------------------------------

# 숫자형(numeric)
# 숫자형 값 표기방법

#   1. 정수형(integer)
print(1)
print(-1)

#   2. 실수형(float)
print(3.14)
print(-3.14)

# ----------------------------------------------------------------------------------------------------------

# 문자형(character/String)
print("Hello")  
print('Hello')  

# 오늘은 파이썬을 시작하는 '첫 날' 입니다!
print("# 오늘은 파이썬을 시작하는 '첫 날' 입니다!")

# 저는 "장가유" 입니다.
print('저는 "장가유" 입니다.')

# ----------------------------------------------------------------------------------------------------------

# 숫자형과 문자형의 차이 인지하기
print(1 + 1)            # 2
print("1" + "1")        # 11 

# ----------------------------------------------------------------------------------------------------------

# 논리형(불린형)
#   참 또는 거짓을 의미하는 데이터 형식이다.
#   단순해 보이지만 이후 배울 판별식, 분기문(조건문) 등에 자주 사용되는 데이터 타입이다.
print(True)   
print(False)   